package lesson_3.homework;

//      Иванов Иван Иванович 23.01.1990 1234567890 m
//      Петров Иван Иванович 01.06.1990 1234567890 m
//      Иванов Семен Иванович 11.03.1980 1234567766 m
//      Петров Сергей Ильич 10.09.1960 9934567890 m
//      Иванов Иван Савельевич 10.01.1980 1234567890 m
//      Петров Иван Иванович 01.12.1990 1234567890 m
//      Петров Сергей Ильич 10.09.1960 9934567890 m
//      Анникова Мария Петровна 30.09.1989 8934167330 f
//      Серинова Ангелина Николаевна 02.07.1980 7755347890 f
// (false) Семенова София Ильинична 1962-10-02 tel7767853 f
// (false) Семенова София Ильинична 1962-10-02 9937767853 f
// Семенова София Ильинична 19.10.2002 9937767853 f

import java.util.InputMismatchException;

public class Main {
    public static void main(String[] args) {

        do {
            try {
                ScanInput input = new ScanInput();
                input.inputEnter();
            } catch (InputMismatchException e) {
                System.out.println("ошибка ввода данных".toUpperCase());
            }


        } while (true);

    }



}
